ArduCAM/Energia/Energia/tools/common/DSLite/common/targetdb/Modules/MSP432/scb.xml
<module id="SCB" HW_revision=""><register id="CPUID" width="32" offset="0xD00" internal="0" description="CPUID Base Register"><bitfield id="REVISION" description="Implementation defined revision number." begin="3" end="0" width="4" rwaccess="R/W"/><bitfield id="PARTNO" description="Number of processor within family." begin="15" end="4" width="12" rwaccess="R/W"/><bitfield id="CONSTANT" description="Reads as 0xC" begin="19" end="16" width="4" rwaccess="R/W"/><bitfield id="VARIANT" description="Implementation defined variant number." begin="23" end="20" width="4" rwaccess="R/W"/><bitfield id="IMPLEMENTER" description="Implementor code." begin="31" end="24" width="8" rwaccess="R/W"/></register><register id="ICSR" width="32" offset="0xD04" internal="0" description="Interrupt Control State Register"><bitfield id="VECTACTIVE" description="Active ISR number field. Reset clears the VECTACTIVE field." begin="8" end="0" width="9" rwaccess="R/W"/><bitfield id="RETTOBASE" description="This bit is 1 when the set of all active exceptions minus the I" begin="11" end="11" width="1" rwaccess="R/W"/><bitfield id="VECTPENDING" description="Pending ISR number field" begin="17" end="12" width="6" rwaccess="R/W"/><bitfield id="ISRPENDING" description="Interrupt pending flag. Excludes NMI and faults." begin="22" end="22" width="1" rwaccess="R/W"><bitenum id="ISRPENDING__0" value="0x0" description="interrupt not pending"/><bitenum id="ISRPENDING__1" value="0x1" description="interrupt pending"/></bitfield><bitfield id="ISRPREEMPT" description="You must only use this at debug time" begin="23" end="23" width="1" rwaccess="R/W"><bitenum id="ISRPREEMPT__0" value="0x0" description="a pending exception is not serviced."/><bitenum id="ISRPREEMPT__1" value="0x1" description="a pending exception is serviced on exit from the debug halt sta"/></bitfield><bitfield id="PENDSTCLR" description="Clear pending SysTick bit" begin="25" end="25" width="1" rwaccess="R/W"><bitenum id="PENDSTCLR__0" value="0x0" description="do not clear pending SysTick"/><bitenum id="PENDSTCLR__1" value="0x1" description="clear pending SysTick"/></bitfield><bitfield id="PENDSTSET" description="Set a pending SysTick bit." begin="26" end="26" width="1" rwaccess="R/W"><bitenum id="PENDSTSET__0" value="0x0" description="do not set pending SysTick"/><bitenum id="PENDSTSET__1" value="0x1" description="set pending SysTick"/></bitfield><bitfield id="PENDSVCLR" description="Clear pending pendSV bit" begin="27" end="27" width="1" rwaccess="R/W"><bitenum id="PENDSVCLR__0" value="0x0" description="do not clear pending pendSV"/><bitenum id="PENDSVCLR__1" value="0x1" description="clear pending pendSV"/></bitfield><bitfield id="PENDSVSET" description="Set pending pendSV bit." begin="28" end="28" width="1" rwaccess="R/W"><bitenum id="PENDSVSET__0" value="0x0" description="do not set pending pendSV"/><bitenum id="PENDSVSET__1" value="0x1" description="set pending PendSV"/></bitfield><bitfield id="NMIPENDSET" description="Set pending NMI bit" begin="31" end="31" width="1" rwaccess="R/W"><bitenum id="NMIPENDSET__0" value="0x0" description="do not set pending NMI"/><bitenum id="NMIPENDSET__1" value="0x1" description="set pending NMI"/></bitfield></register><register id="VTOR" width="32" offset="0xD08" internal="0" description="Vector Table Offset Register"><bitfield id="TBLOFF" description="Vector table base offset field" begin="28" end="7" width="22" rwaccess="R/W"/><bitfield id="TBLBASE" description="Table base is in Code (0) or RAM (1)." begin="29" end="29" width="1" rwaccess="R/W"/></register><register id="AIRCR" width="32" offset="0xD0C" internal="0" description="Application Interrupt/Reset Control Register"><bitfield id="VECTRESET" description="System Reset bit" begin="0" end="0" width="1" rwaccess="R/W"/><bitfield id="VECTCLRACTIVE" description="Clears all active state information for active NMI, fault, and " begin="1" end="1" width="1" rwaccess="R/W"/><bitfield id="SYSRESETREQ" description="Causes a signal to be asserted to the outer system that indicat" begin="2" end="2" width="1" rwaccess="R/W"/><bitfield id="PRIGROUP" description="Interrupt priority grouping field" begin="10" end="8" width="3" rwaccess="R/W"/><bitfield id="ENDIANESS" description="Data endianness bit" begin="15" end="15" width="1" rwaccess="R/W"><bitenum id="ENDIANESS__0" value="0x0" description="little endian"/><bitenum id="ENDIANESS__1" value="0x1" description="big endian"/></bitfield><bitfield id="VECTKEY" description="Register key" begin="31" end="16" width="16" rwaccess="R/W"/></register><register id="SCR" width="32" offset="0xD10" internal="0" description="System Control Register"><bitfield id="SLEEPONEXIT" description="Sleep on exit when returning from Handler mode to Thread mode" begin="1" end="1" width="1" rwaccess="R/W"><bitenum id="SLEEPONEXIT__0" value="0x0" description="do not sleep when returning to thread mode"/><bitenum id="SLEEPONEXIT__1" value="0x1" description="sleep on ISR exit"/></bitfield><bitfield id="SLEEPDEEP" description="Sleep deep bit." begin="2" end="2" width="1" rwaccess="R/W"><bitenum id="SLEEPDEEP__0" value="0x0" description="not OK to turn off system clock"/><bitenum id="SLEEPDEEP__1" value="0x1" description="indicates to the system that Cortex-M4 clock can be stopped"/></bitfield><bitfield id="SEVONPEND" description="When enabled, this causes WFE to wake up when an interrupt move" begin="4" end="4" width="1" rwaccess="R/W"/></register><register id="CCR" width="32" offset="0xD14" internal="0" description="Configuration Control Register"><bitfield id="NONBASETHREDENA" description="When 0, default, It is only possible to enter Thread mode when " begin="0" end="0" width="1" rwaccess="R/W"/><bitfield id="USERSETMPEND" description="If written as 1, enables user code to write the Software Trigge" begin="1" end="1" width="1" rwaccess="R/W"/><bitfield id="UNALIGN_TRP" description="Trap for unaligned access" begin="3" end="3" width="1" rwaccess="R/W"/><bitfield id="DIV_0_TRP" description="Trap on Divide by 0" begin="4" end="4" width="1" rwaccess="R/W"/><bitfield id="BFHFNMIGN" description="When enabled, this causes handlers running at priority -1 and -" begin="8" end="8" width="1" rwaccess="R/W"/><bitfield id="STKALIGN" description="Stack alignment bit." begin="9" end="9" width="1" rwaccess="R/W"><bitenum id="STKALIGN__0" value="0x0" description="Only 4-byte alignment is guaranteed for the SP used prior to th"/><bitenum id="STKALIGN__1" value="0x1" description="On exception entry, the SP used prior to the exception is adjus"/></bitfield></register><register id="SHPR1" width="32" offset="0xD18" internal="0" description="System Handlers 4-7 Priority Register"><bitfield id="PRI_4" description="Priority of system handler 4." begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="PRI_5" description="Priority of system handler 5." begin="15" end="8" width="8" rwaccess="R/W"/><bitfield id="PRI_6" description="Priority of system handler 6." begin="23" end="16" width="8" rwaccess="R/W"/><bitfield id="PRI_7" description="Priority of system handler 7." begin="31" end="24" width="8" rwaccess="R/W"/></register><register id="SHPR2" width="32" offset="0xD1C" internal="0" description="System Handlers 8-11 Priority Register"><bitfield id="PRI_8" description="Priority of system handler 8." begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="PRI_9" description="Priority of system handler 9." begin="15" end="8" width="8" rwaccess="R/W"/><bitfield id="PRI_10" description="Priority of system handler 10." begin="23" end="16" width="8" rwaccess="R/W"/><bitfield id="PRI_11" description="Priority of system handler 11." begin="31" end="24" width="8" rwaccess="R/W"/></register><register id="SHPR3" width="32" offset="0xD20" internal="0" description="System Handlers 12-15 Priority Register"><bitfield id="PRI_12" description="Priority of system handler 12." begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="PRI_13" description="Priority of system handler 13." begin="15" end="8" width="8" rwaccess="R/W"/><bitfield id="PRI_14" description="Priority of system handler 14." begin="23" end="16" width="8" rwaccess="R/W"/><bitfield id="PRI_15" description="Priority of system handler 15." begin="31" end="24" width="8" rwaccess="R/W"/></register><register id="SHCSR" width="32" offset="0xD24" internal="0" description="System Handler Control and State Register"><bitfield id="MEMFAULTACT" description="MemManage active flag." begin="0" end="0" width="1" rwaccess="R/W"><bitenum id="MEMFAULTACT__0" value="0x0" description="not active"/><bitenum id="MEMFAULTACT__1" value="0x1" description="active"/></bitfield><bitfield id="BUSFAULTACT" description="BusFault active flag." begin="1" end="1" width="1" rwaccess="R/W"><bitenum id="BUSFAULTACT__0" value="0x0" description="not active"/><bitenum id="BUSFAULTACT__1" value="0x1" description="active"/></bitfield><bitfield id="USGFAULTACT" description="UsageFault active flag." begin="3" end="3" width="1" rwaccess="R/W"><bitenum id="USGFAULTACT__0" value="0x0" description="not active"/><bitenum id="USGFAULTACT__1" value="0x1" description="active"/></bitfield><bitfield id="SVCALLACT" description="SVCall active flag." begin="7" end="7" width="1" rwaccess="R/W"><bitenum id="SVCALLACT__0" value="0x0" description="not active"/><bitenum id="SVCALLACT__1" value="0x1" description="active"/></bitfield><bitfield id="MONITORACT" description="the Monitor active flag." begin="8" end="8" width="1" rwaccess="R/W"><bitenum id="MONITORACT__0" value="0x0" description="not active"/><bitenum id="MONITORACT__1" value="0x1" description="active"/></bitfield><bitfield id="PENDSVACT" description="PendSV active flag." begin="10" end="10" width="1" rwaccess="R/W"><bitenum id="PENDSVACT__0" value="0x0" description="not active"/><bitenum id="PENDSVACT__1" value="0x1" description="active"/></bitfield><bitfield id="SYSTICKACT" description="SysTick active flag." begin="11" end="11" width="1" rwaccess="R/W"><bitenum id="SYSTICKACT__0" value="0x0" description="not active"/><bitenum id="SYSTICKACT__1" value="0x1" description="active"/></bitfield><bitfield id="USGFAULTPENDED" description="usage fault pended flag." begin="12" end="12" width="1" rwaccess="R/W"><bitenum id="USGFAULTPENDED__0" value="0x0" description="not pended"/><bitenum id="USGFAULTPENDED__1" value="0x1" description="pended"/></bitfield><bitfield id="MEMFAULTPENDED" description="MemManage pended flag." begin="13" end="13" width="1" rwaccess="R/W"><bitenum id="MEMFAULTPENDED__0" value="0x0" description="not pended"/><bitenum id="MEMFAULTPENDED__1" value="0x1" description="pended"/></bitfield><bitfield id="BUSFAULTPENDED" description="BusFault pended flag." begin="14" end="14" width="1" rwaccess="R/W"><bitenum id="BUSFAULTPENDED__0" value="0x0" description="not pended"/><bitenum id="BUSFAULTPENDED__1" value="0x1" description="pended"/></bitfield><bitfield id="SVCALLPENDED" description="SVCall pended flag." begin="15" end="15" width="1" rwaccess="R/W"><bitenum id="SVCALLPENDED__0" value="0x0" description="not pended"/><bitenum id="SVCALLPENDED__1" value="0x1" description="pended"/></bitfield><bitfield id="MEMFAULTENA" description="MemManage fault system handler enable" begin="16" end="16" width="1" rwaccess="R/W"><bitenum id="MEMFAULTENA__0" value="0x0" description="disabled"/><bitenum id="MEMFAULTENA__1" value="0x1" description="enabled"/></bitfield><bitfield id="BUSFAULTENA" description="Bus fault system handler enable" begin="17" end="17" width="1" rwaccess="R/W"><bitenum id="BUSFAULTENA__0" value="0x0" description="disabled"/><bitenum id="BUSFAULTENA__1" value="0x1" description="enabled"/></bitfield><bitfield id="USGFAULTENA" description="Usage fault system handler enable" begin="18" end="18" width="1" rwaccess="R/W"><bitenum id="USGFAULTENA__0" value="0x0" description="disabled"/><bitenum id="USGFAULTENA__1" value="0x1" description="enabled"/></bitfield></register><register id="CFSR" width="32" offset="0xD28" internal="0" description="Configurable Fault Status Registers"><bitfield id="IACCVIOL" description="Instruction access violation flag" begin="0" end="0" width="1" rwaccess="R/W"/><bitfield id="DACCVIOL" description="Data access violation flag" begin="1" end="1" width="1" rwaccess="R/W"/><bitfield id="MUNSTKERR" description="Unstack from exception return has caused one or more access vio" begin="3" end="3" width="1" rwaccess="R/W"/><bitfield id="MSTKERR" description="Stacking from exception has caused one or more access violation" begin="4" end="4" width="1" rwaccess="R/W"/><bitfield id="MLSPERR" description="Indicates if MemManage fault occurred during FP lazy state pres" begin="5" end="5" width="1" rwaccess="R/W"/><bitfield id="MMARVALID" description="Memory Manage Address Register (MMAR) address valid flag" begin="7" end="7" width="1" rwaccess="R/W"/><bitfield id="IBUSERR" description="Instruction bus error flag" begin="8" end="8" width="1" rwaccess="R/W"/><bitfield id="PRECISERR" description="Precise data bus error return." begin="9" end="9" width="1" rwaccess="R/W"/><bitfield id="IMPRECISERR" description="Imprecise data bus error" begin="10" end="10" width="1" rwaccess="R/W"/><bitfield id="UNSTKERR" description="Unstack from exception return has caused one or more bus faults" begin="11" end="11" width="1" rwaccess="R/W"/><bitfield id="STKERR" description="Stacking from exception has caused one or more bus faults" begin="12" end="12" width="1" rwaccess="R/W"/><bitfield id="LSPERR" description="Indicates if bus fault occurred during FP lazy state preservati" begin="13" end="13" width="1" rwaccess="R/W"/><bitfield id="BFARVALID" description="This bit is set if the Bus Fault Address Register (BFAR) contai" begin="15" end="15" width="1" rwaccess="R/W"/><bitfield id="UNDEFINSTR" description="The UNDEFINSTR flag is set when the processor attempts to execu" begin="16" end="16" width="1" rwaccess="R/W"/><bitfield id="INVSTATE" description="Invalid combination of EPSR and instruction, for reasons other " begin="17" end="17" width="1" rwaccess="R/W"/><bitfield id="INVPC" description="Attempt to load EXC_RETURN into PC illegally" begin="18" end="18" width="1" rwaccess="R/W"/><bitfield id="NOCP" description="Attempt to use a coprocessor instruction" begin="19" end="19" width="1" rwaccess="R/W"/><bitfield id="UNALIGNED" description="When UNALIGN_TRP is enabled (see Configuration Control Register" begin="24" end="24" width="1" rwaccess="R/W"/><bitfield id="DIVBYZERO" description="When DIV_0_TRP (see Configuration Control Register on page 8-26" begin="25" end="25" width="1" rwaccess="R/W"/></register><register id="HFSR" width="32" offset="0xD2C" internal="0" description="Hard Fault Status Register"><bitfield id="VECTTBL" description="This bit is set if there is a fault because of vector table rea" begin="1" end="1" width="1" rwaccess="R/W"/><bitfield id="FORCED" description="Hard Fault activated because a Configurable Fault was received " begin="30" end="30" width="1" rwaccess="R/W"/><bitfield id="DEBUGEVT" description="This bit is set if there is a fault related to debug" begin="31" end="31" width="1" rwaccess="R/W"/></register><register id="DFSR" width="32" offset="0xD30" internal="0" description="Debug Fault Status Register"><bitfield id="HALTED" description="Halt request flag" begin="0" end="0" width="1" rwaccess="R/W"><bitenum id="HALTED__0" value="0x0" description="no halt request"/><bitenum id="HALTED__1" value="0x1" description="halt requested by NVIC, including step"/></bitfield><bitfield id="BKPT" description="BKPT flag" begin="1" end="1" width="1" rwaccess="R/W"><bitenum id="BKPT__0" value="0x0" description="no BKPT instruction execution"/><bitenum id="BKPT__1" value="0x1" description="BKPT instruction execution"/></bitfield><bitfield id="DWTTRAP" description="Data Watchpoint and Trace (DWT) flag" begin="2" end="2" width="1" rwaccess="R/W"><bitenum id="DWTTRAP__0" value="0x0" description="no DWT match"/><bitenum id="DWTTRAP__1" value="0x1" description="DWT match"/></bitfield><bitfield id="VCATCH" description="Vector catch flag" begin="3" end="3" width="1" rwaccess="R/W"><bitenum id="VCATCH__0" value="0x0" description="no vector catch occurred"/><bitenum id="VCATCH__1" value="0x1" description="vector catch occurred"/></bitfield><bitfield id="EXTERNAL" description="External debug request flag" begin="4" end="4" width="1" rwaccess="R/W"><bitenum id="EXTERNAL__0" value="0x0" description="EDBGRQ signal not asserted"/><bitenum id="EXTERNAL__1" value="0x1" description="EDBGRQ signal asserted"/></bitfield></register><register id="MMFAR" width="32" offset="0xD34" internal="0" description="Mem Manage Fault Address Register"><bitfield id="ADDRESS" description="Mem Manage fault address field" begin="31" end="0" width="32" rwaccess="R/W"/></register><register id="BFAR" width="32" offset="0xD38" internal="0" description="Bus Fault Address Register"><bitfield id="ADDRESS" description="Bus fault address field" begin="31" end="0" width="32" rwaccess="R/W"/></register><register id="AFSR" width="32" offset="0xD3C" internal="0" description="Auxiliary Fault Status Register"><bitfield id="IMPDEF" description="Implementation defined" begin="31" end="0" width="32" rwaccess="R/W"/></register><register id="PFR0" width="32" offset="0xD40" internal="0" description="Processor Feature register0"><bitfield id="STATE0" description="State0 (T-bit == 0)" begin="3" end="0" width="4" rwaccess="R/W"><bitenum id="STATE0__0" value="0x0" description="no ARM encoding"/><bitenum id="STATE0__1" value="0x1" description="N/A"/></bitfield><bitfield id="STATE1" description="State1 (T-bit == 1)" begin="7" end="4" width="4" rwaccess="R/W"><bitenum id="STATE1__0" value="0x0" description="N/A"/><bitenum id="STATE1__1" value="0x1" description="N/A"/><bitenum id="STATE1__2" value="0x2" description="Thumb-2 encoding with the 16-bit basic instructions plus 32-bit"/><bitenum id="STATE1__3" value="0x3" description="Thumb-2 encoding with all Thumb-2 basic instructions"/></bitfield></register><register id="PFR1" width="32" offset="0xD44" internal="0" description="Processor Feature register1"><bitfield id="MICROCONTROLLER_PROGRAMMERS_MODEL" description="Microcontroller programmer's model" begin="11" end="8" width="4" rwaccess="R/W"><bitenum id="MICROCONTROLLER_PROGRAMMERS_MODEL__0" value="0x0" description="not supported"/><bitenum id="MICROCONTROLLER_PROGRAMMERS_MODEL__2" value="0x2" description="two-stack support"/></bitfield></register><register id="DFR0" width="32" offset="0xD48" internal="0" description="Debug Feature register0"><bitfield id="MICROCONTROLLER_DEBUG_MODEL" description="Microcontroller Debug Model - memory mapped" begin="23" end="20" width="4" rwaccess="R/W"><bitenum id="MICROCONTROLLER_DEBUG_MODEL__0" value="0x0" description="not supported"/><bitenum id="MICROCONTROLLER_DEBUG_MODEL__1" value="0x1" description="Microcontroller debug v1 (ITMv1, DWTv1, optional ETM)"/></bitfield></register><register id="AFR0" width="32" offset="0xD4C" internal="0" description="Auxiliary Feature register0"/><register id="MMFR0" width="32" offset="0xD50" internal="0" description="Memory Model Feature register0"><bitfield id="PMSA_SUPPORT" description="PMSA support" begin="7" end="4" width="4" rwaccess="R/W"><bitenum id="PMSA_SUPPORT__0" value="0x0" description="not supported"/><bitenum id="PMSA_SUPPORT__1" value="0x1" description="IMPLEMENTATION DEFINED (N/A)"/><bitenum id="PMSA_SUPPORT__2" value="0x2" description="PMSA base (features as defined for ARMv6) (N/A)"/><bitenum id="PMSA_SUPPORT__3" value="0x3" description="PMSAv7 (base plus subregion support)"/></bitfield><bitfield id="CACHE_COHERENCE_SUPPORT" description="Cache coherence support" begin="11" end="8" width="4" rwaccess="R/W"><bitenum id="CACHE_COHERENCE_SUPPORT__0" value="0x0" description="no shared support"/><bitenum id="CACHE_COHERENCE_SUPPORT__1" value="0x1" description="partial-inner-shared coherency (coherency amongst some - but no"/><bitenum id="CACHE_COHERENCE_SUPPORT__2" value="0x2" description="full-inner-shared coherency (coherency amongst all of the entit"/><bitenum id="CACHE_COHERENCE_SUPPORT__3" value="0x3" description="full coherency (coherency amongst all of the entities)"/></bitfield><bitfield id="OUTER_NON_SHARABLE_SUPPORT" description="Outer non-sharable support" begin="15" end="12" width="4" rwaccess="R/W"><bitenum id="OUTER_NON_SHARABLE_SUPPORT__0" value="0x0" description="Outer non-sharable not supported"/><bitenum id="OUTER_NON_SHARABLE_SUPPORT__1" value="0x1" description="Outer sharable supported"/></bitfield><bitfield id="AUILIARY_REGISTER_SUPPORT" description="Auxiliary register support" begin="23" end="20" width="4" rwaccess="R/W"><bitenum id="AUILIARY_REGISTER_SUPPORT__0" value="0x0" description="not supported"/><bitenum id="AUILIARY_REGISTER_SUPPORT__1" value="0x1" description="Auxiliary control register"/></bitfield></register><register id="MMFR1" width="32" offset="0xD54" internal="0" description="Memory Model Feature register1"/><register id="MMFR2" width="32" offset="0xD58" internal="0" description="Memory Model Feature register2"><bitfield id="WAIT_FOR_INTERRUPT_STALLING" description="wait for interrupt stalling" begin="27" end="24" width="4" rwaccess="R/W"><bitenum id="WAIT_FOR_INTERRUPT_STALLING__0" value="0x0" description="not supported"/><bitenum id="WAIT_FOR_INTERRUPT_STALLING__1" value="0x1" description="wait for interrupt supported"/></bitfield></register><register id="MMFR3" width="32" offset="0xD5C" internal="0" description="Memory Model Feature register3"/><register id="ISAR0" width="32" offset="0xD60" internal="0" description="ISA Feature register0"><bitfield id="BITCOUNT_INSTRS" description="BitCount instructions" begin="7" end="4" width="4" rwaccess="R/W"><bitenum id="BITCOUNT_INSTRS__0" value="0x0" description="no bit-counting instructions present"/><bitenum id="BITCOUNT_INSTRS__1" value="0x1" description="adds CLZ"/></bitfield><bitfield id="BITFIELD_INSTRS" description="BitField instructions" begin="11" end="8" width="4" rwaccess="R/W"><bitenum id="BITFIELD_INSTRS__0" value="0x0" description="no bitfield instructions present"/><bitenum id="BITFIELD_INSTRS__1" value="0x1" description="adds BFC, BFI, SBFX, UBFX"/></bitfield><bitfield id="CMPBRANCH_INSTRS" description="CmpBranch instructions" begin="15" end="12" width="4" rwaccess="R/W"><bitenum id="CMPBRANCH_INSTRS__0" value="0x0" description="no combined compare-and-branch instructions present"/><bitenum id="CMPBRANCH_INSTRS__1" value="0x1" description="adds CB{N}Z"/></bitfield><bitfield id="COPROC_INSTRS" description="Coprocessor instructions" begin="19" end="16" width="4" rwaccess="R/W"><bitenum id="COPROC_INSTRS__0" value="0x0" description="no coprocessor support, other than for separately attributed ar"/><bitenum id="COPROC_INSTRS__1" value="0x1" description="adds generic CDP, LDC, MCR, MRC, STC"/><bitenum id="COPROC_INSTRS__2" value="0x2" description="adds generic CDP2, LDC2, MCR2, MRC2, STC2"/><bitenum id="COPROC_INSTRS__3" value="0x3" description="adds generic MCRR, MRRC"/><bitenum id="COPROC_INSTRS__4" value="0x4" description="adds generic MCRR2, MRRC2"/></bitfield><bitfield id="DEBUG_INSTRS" description="Debug instructions" begin="23" end="20" width="4" rwaccess="R/W"><bitenum id="DEBUG_INSTRS__0" value="0x0" description="no debug instructions present"/><bitenum id="DEBUG_INSTRS__1" value="0x1" description="adds BKPT"/></bitfield><bitfield id="DIVIDE_INSTRS" description="Divide instructions" begin="27" end="24" width="4" rwaccess="R/W"><bitenum id="DIVIDE_INSTRS__0" value="0x0" description="no divide instructions present"/><bitenum id="DIVIDE_INSTRS__1" value="0x1" description="adds SDIV, UDIV (v1 quotient only result)"/></bitfield></register><register id="ISAR1" width="32" offset="0xD64" internal="0" description="ISA Feature register1"><bitfield id="ETEND_INSRS" description="Extend instructions" begin="15" end="12" width="4" rwaccess="R/W"><bitenum id="ETEND_INSRS__0" va