ArduCAM/Energia/Energia/tools/common/DSLite/common/targetdb/Modules/MSP432/scb.xml
lue="0x0" description="no scalar (i.e. non-SIMD) sign/zero-extend instructions present"/><bitenum id="ETEND_INSRS__1" value="0x1" description="adds SXTB, SXTH, UXTB, UXTH"/><bitenum id="ETEND_INSRS__2" value="0x2" description="N/A"/></bitfield><bitfield id="IFTHEN_INSTRS" description="IfThen instructions" begin="19" end="16" width="4" rwaccess="R/W"><bitenum id="IFTHEN_INSTRS__0" value="0x0" description="IT instructions not present"/><bitenum id="IFTHEN_INSTRS__1" value="0x1" description="adds IT instructions (and IT bits in PSRs)"/></bitfield><bitfield id="IMMEDIATE_INSTRS" description="Immediate instructions" begin="23" end="20" width="4" rwaccess="R/W"><bitenum id="IMMEDIATE_INSTRS__0" value="0x0" description="no special immediate-generating instructions present"/><bitenum id="IMMEDIATE_INSTRS__1" value="0x1" description="adds ADDW, MOVW, MOVT, SUBW"/></bitfield><bitfield id="INTERWORK_INSTRS" description="Interwork instructions" begin="27" end="24" width="4" rwaccess="R/W"><bitenum id="INTERWORK_INSTRS__0" value="0x0" description="no interworking instructions supported"/><bitenum id="INTERWORK_INSTRS__1" value="0x1" description="adds BX (and T bit in PSRs)"/><bitenum id="INTERWORK_INSTRS__2" value="0x2" description="adds BLX, and PC loads have BX-like behavior"/><bitenum id="INTERWORK_INSTRS__3" value="0x3" description="N/A"/></bitfield></register><register id="ISAR2" width="32" offset="0xD68" internal="0" description="ISA Feature register2"><bitfield id="LOADSTORE_INSTRS" description="LoadStore instructions" begin="3" end="0" width="4" rwaccess="R/W"><bitenum id="LOADSTORE_INSTRS__0" value="0x0" description="no additional normal load/store instructions present"/><bitenum id="LOADSTORE_INSTRS__1" value="0x1" description="adds LDRD/STRD"/></bitfield><bitfield id="MEMHINT_INSTRS" description="MemoryHint instructions" begin="7" end="4" width="4" rwaccess="R/W"><bitenum id="MEMHINT_INSTRS__0" value="0x0" description="no memory hint instructions presen"/><bitenum id="MEMHINT_INSTRS__1" value="0x1" description="adds PLD"/><bitenum id="MEMHINT_INSTRS__2" value="0x2" description="adds PLD (ie a repeat on value 1)"/><bitenum id="MEMHINT_INSTRS__3" value="0x3" description="adds PLI"/></bitfield><bitfield id="MULTIACCESSINT_INSTRS" description="Multi-Access interruptible instructions" begin="11" end="8" width="4" rwaccess="R/W"><bitenum id="MULTIACCESSINT_INSTRS__0" value="0x0" description="the (LDM/STM) instructions are non-interruptible"/><bitenum id="MULTIACCESSINT_INSTRS__1" value="0x1" description="the (LDM/STM) instructions are restartable"/><bitenum id="MULTIACCESSINT_INSTRS__2" value="0x2" description="the (LDM/STM) instructions are continuable"/></bitfield><bitfield id="MULT_INSTRS" description="Multiply instructions" begin="15" end="12" width="4" rwaccess="R/W"><bitenum id="MULT_INSTRS__0" value="0x0" description="only MUL present"/><bitenum id="MULT_INSTRS__1" value="0x1" description="adds MLA"/><bitenum id="MULT_INSTRS__2" value="0x2" description="adds MLS"/></bitfield><bitfield id="MULTS_INSTRS" description="Multiply instructions (advanced, signed)" begin="19" end="16" width="4" rwaccess="R/W"><bitenum id="MULTS_INSTRS__0" value="0x0" description="no signed multiply instructions present"/><bitenum id="MULTS_INSTRS__1" value="0x1" description="adds SMULL, SMLAL"/><bitenum id="MULTS_INSTRS__2" value="0x2" description="N/A"/><bitenum id="MULTS_INSTRS__3" value="0x3" description="N/A"/></bitfield><bitfield id="MULTU_INSTRS" description="Multiply instructions (advanced, unsigned)" begin="23" end="20" width="4" rwaccess="R/W"><bitenum id="MULTU_INSTRS__0" value="0x0" description="no unsigned multiply instructions present"/><bitenum id="MULTU_INSTRS__1" value="0x1" description="adds UMULL, UMLAL"/><bitenum id="MULTU_INSTRS__2" value="0x2" description="N/A"/></bitfield><bitfield id="REVERSAL_INSTRS" description="Reversal instructions" begin="31" end="28" width="4" rwaccess="R/W"><bitenum id="REVERSAL_INSTRS__0" value="0x0" description="no reversal instructions present"/><bitenum id="REVERSAL_INSTRS__1" value="0x1" description="adds REV, REV16, REVSH"/><bitenum id="REVERSAL_INSTRS__2" value="0x2" description="adds RBIT"/></bitfield></register><register id="ISAR3" width="32" offset="0xD6C" internal="0" description="ISA Feature register3"><bitfield id="SATRUATE_INSTRS" description="Saturate instructions" begin="3" end="0" width="4" rwaccess="R/W"><bitenum id="SATRUATE_INSTRS__0" value="0x0" description="no non-SIMD saturate instructions present"/><bitenum id="SATRUATE_INSTRS__1" value="0x1" description="N/A"/></bitfield><bitfield id="SIMD_INSTRS" description="SIMD instructions" begin="7" end="4" width="4" rwaccess="R/W"><bitenum id="SIMD_INSTRS__0" value="0x0" description="no SIMD instructions present"/><bitenum id="SIMD_INSTRS__1" value="0x1" description="adds SSAT, USAT (and the Q flag in the PSRs)"/><bitenum id="SIMD_INSTRS__3" value="0x3" description="N/A"/></bitfield><bitfield id="SVC_INSTRS" description="SVC instructions" begin="11" end="8" width="4" rwaccess="R/W"><bitenum id="SVC_INSTRS__0" value="0x0" description="no SVC (SWI) instructions present"/><bitenum id="SVC_INSTRS__1" value="0x1" description="adds SVC (SWI)"/></bitfield><bitfield id="SYNCPRIM_INSTRS" description="SyncPrim instructions" begin="15" end="12" width="4" rwaccess="R/W"><bitenum id="SYNCPRIM_INSTRS__0" value="0x0" description="no synchronization primitives present"/><bitenum id="SYNCPRIM_INSTRS__1" value="0x1" description="adds LDREX, STREX"/><bitenum id="SYNCPRIM_INSTRS__2" value="0x2" description="adds LDREXB, LDREXH, LDREXD, STREXB, STREXH, STREXD, CLREX(N/A)"/></bitfield><bitfield id="TABBRANCH_INSTRS" description="TableBranch instructions" begin="19" end="16" width="4" rwaccess="R/W"><bitenum id="TABBRANCH_INSTRS__0" value="0x0" description="no table-branch instructions present"/><bitenum id="TABBRANCH_INSTRS__1" value="0x1" description="adds TBB, TBH"/></bitfield><bitfield id="THUMBCOPY_INSTRS" description="ThumbCopy instructions" begin="23" end="20" width="4" rwaccess="R/W"><bitenum id="THUMBCOPY_INSTRS__0" value="0x0" description="Thumb MOV(register) instruction does not allow low reg -&gt; low r"/><bitenum id="THUMBCOPY_INSTRS__1" value="0x1" description="adds Thumb MOV(register) low reg -&gt; low reg and the CPY alias"/></bitfield><bitfield id="TRUENOP_INSTRS" description="TrueNOP instructions" begin="27" end="24" width="4" rwaccess="R/W"><bitenum id="TRUENOP_INSTRS__0" value="0x0" description="true NOP instructions not present - that is, NOP instructions w"/><bitenum id="TRUENOP_INSTRS__1" value="0x1" description="adds &quot;true NOP&quot;, and the capability of additional &quot;NOP compatib"/></bitfield></register><register id="ISAR4" width="32" offset="0xD70" internal="0" description="ISA Feature register4"><bitfield id="UNPRIV_INSTRS" description="Unprivileged instructions" begin="3" end="0" width="4" rwaccess="R/W"><bitenum id="UNPRIV_INSTRS__0" value="0x0" description="no &quot;T variant&quot; instructions exist"/><bitenum id="UNPRIV_INSTRS__1" value="0x1" description="adds LDRBT, LDRT, STRBT, STRT"/><bitenum id="UNPRIV_INSTRS__2" value="0x2" description="adds LDRHT, LDRSBT, LDRSHT, STRHT"/></bitfield><bitfield id="WITHSHIFTS_INSTRS" description="WithShift instructions" begin="7" end="4" width="4" rwaccess="R/W"><bitenum id="WITHSHIFTS_INSTRS__0" value="0x0" description="non-zero shifts only support MOV and shift instructions (see no"/><bitenum id="WITHSHIFTS_INSTRS__1" value="0x1" description="shifts of loads/stores over the range LSL 0-3"/><bitenum id="WITHSHIFTS_INSTRS__3" value="0x3" description="adds other constant shift options."/><bitenum id="WITHSHIFTS_INSTRS__4" value="0x4" description="adds register-controlled shift options."/></bitfield><bitfield id="WRITEBACK_INSTRS" description="Writeback instructions" begin="11" end="8" width="4" rwaccess="R/W"><bitenum id="WRITEBACK_INSTRS__0" value="0x0" description="only non-writeback addressing modes present, except that LDMIA/"/><bitenum id="WRITEBACK_INSTRS__1" value="0x1" description="adds all currently-defined writeback addressing modes (ARMv7, T"/></bitfield><bitfield id="BARRIER_INSTRS" description="Barrier instructions" begin="19" end="16" width="4" rwaccess="R/W"><bitenum id="BARRIER_INSTRS__0" value="0x0" description="no barrier instructions supported"/><bitenum id="BARRIER_INSTRS__1" value="0x1" description="adds DMB, DSB, ISB barrier instructions"/></bitfield><bitfield id="SYNCPRIM_INSTRS_FRAC" description="SyncPrim_instrs_frac" begin="23" end="20" width="4" rwaccess="R/W"><bitenum id="SYNCPRIM_INSTRS_FRAC__0" value="0x0" description="no additional support"/><bitenum id="SYNCPRIM_INSTRS_FRAC__3" value="0x3" description="adds CLREX, LDREXB, STREXB, LDREXH, STREXH"/></bitfield><bitfield id="PSR_M_INSTRS" description="PSR_M_instrs" begin="27" end="24" width="4" rwaccess="R/W"><bitenum id="PSR_M_INSTRS__0" value="0x0" description="instructions not present"/><bitenum id="PSR_M_INSTRS__1" value="0x1" description="adds CPS, MRS, and MSR instructions (M-profile forms)"/></bitfield></register><register id="CPACR" width="32" offset="0xD88" internal="0" description="Coprocessor Access Control Register"><bitfield id="CP10" description="Access privileges for coprocessor 10" begin="21" end="20" width="2" rwaccess="R/W"/><bitfield id="CP11" description="Access privileges for coprocessor 11" begin="23" end="22" width="2" rwaccess="R/W"/></register></module>